Revit 2026 API

# PointCloudOverridesAssign Method

---

Assigns values of the source overrides to this object.

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Assign(
	PointCloudOverrides other
)
```
```vb
Public Sub Assign (
	other As PointCloudOverrides
)
```
```cpp
public:
void Assign(
	PointCloudOverrides^ other
)
```
```fsharp
member Assign :
        other : PointCloudOverrides -> unit
```

#### Parameters

other PointCloudOverrides
     The source overrides.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PointCloudOverrides Class

Autodesk.Revit.DB.PointClouds Namespace